In [1]:
import numpy as np
import pandas as pd

In [3]:
df = {'A':[1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}
df

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [5]:
df = pd.DataFrame(d)
df
#missing values here

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna() #drop missing values. If there's any null or missing values in a row, pandas will drop that row

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1) #drop any column with null values in it

   C
0  1
1  2
2  3

In [8]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(thresh=2) #drop the column with atleast 2 null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
#to fill in missing values

df.fillna(value ='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [13]:
df['A'].fillna(value = df['A'].mean()) #A coln. to add mean of a coln value in missing data

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64